docs/content/examples/block-imports.org
#+TITLE: Block Imports - Complete Guide
#+DATE: 2025-12-09

* Introduction

Org-Press supports a powerful *block import* system that allows you to import and reuse code blocks across org files, enabling true literate programming and code composition.

** What You'll Learn

This comprehensive guide demonstrates:
- Importing blocks from other files by name
- Importing blocks by index position
- Self-importing within the same file
- Composing complex functionality from simple blocks
- Cross-file code sharing and reusability
- Server-side and client-side imports
- 3D modeling with imported geometry

** Import Syntax

The import syntax uses special query parameters:

#+begin_export html
<pre><code>// Import by name
import { function } from './file.org?name=block-name';

// Import by index (0-based)
import { function } from './file.org?index=0';

// Import default export
import value from './file.org?name=block-name';
</code></pre>
#+end_export

** The Library File

This guide uses [[file:/examples/block-import-library.html][block-import-library.org]] as a shared library of reusable utilities, demonstrating cross-file imports. The library contains:

- JavaScript utilities (math, string manipulation)
- CSS utilities (flexbox, animations)
- JSCad geometry primitives and composite shapes
- Server-side data processing
- TypeScript type-safe utilities

* Part 1: Self-Import (Same File)

Before exploring cross-file imports, let's see how blocks can import from the same file.

** Define a Local Helper

First, let's define a helper block in this file:

#+name: local-helper
#+begin_src javascript
export function formatMessage(name) {
  return `Hello, ${name}! Welcome to org block imports.`;
}

export function getTimestamp() {
  return new Date().toLocaleString();
}
#+end_src

** Use the Local Helper

Now we import and use it from another block in this same file:

#+name: use-local-helper
#+begin_src javascript :use dom | withSourceCode
// Import from this same file using self-reference
import { formatMessage, getTimestamp } from './block-imports.org?name=local-helper';

const greeting = formatMessage('Developer');
const timestamp = getTimestamp();

const container = document.createElement('div');
container.style.cssText = 'padding: 1rem; background: #e3f2fd; border-radius: 8px; margin: 1rem 0;';
container.innerHTML = `
  <h4 style="margin-top: 0; color: #1976d2;">Self-Import Demo</h4>
  <p>${greeting}</p>
  <p><small>Generated at: ${timestamp}</small></p>
`;

export default container;
#+end_src

