examples/block-imports.html
<!DOCTYPE html>
<html lang="en"><head><meta charSet="utf-8"/><meta name="viewport" content="width=device-width, initial-scale=1"/><title>Block Imports - Complete Guide | org-press</title><link rel="stylesheet" href="https://cdn.jsdelivr.net/gh/highlightjs/cdn-release@11.9.0/build/styles/github.min.css" media="(prefers-color-scheme: light)"/><link rel="stylesheet" href="https://cdn.jsdelivr.net/gh/highlightjs/cdn-release@11.9.0/build/styles/github-dark.min.css" media="(prefers-color-scheme: dark)"/><link rel="stylesheet" href="/assets/theme-DsForQV0.css"/></head><body><div class="docs-layout"><header class="top-nav"><div class="top-nav-container"><a href="/index.html" class="top-nav-logo"><span class="logo-text">Org-Press</span></a><nav class="top-nav-links"><a href="/guide/index.html" class="top-nav-link " data-match="^\/(guide(\/|$)|getting-started|index\.html$)">Guide</a><a href="/config/index.html" class="top-nav-link " data-match="^\/config(\/|$)">Config</a><a href="/plugins/index.html" class="top-nav-link " data-match="^\/plugins(\/|$)">Plugins</a><a href="/api/index.html" class="top-nav-link " data-match="^\/api(\/|$)">API</a></nav><div class="top-nav-social"><a href="https://github.com/org-press/org-press/blob/main/docs/content/examples/block-imports.org?plain=1" class="top-nav-source-link" target="_blank" rel="noopener noreferrer" title="View page source on GitHub">:view-source</a><a href="https://github.com/org-press/org-press" class="top-nav-social-link" target="_blank" rel="noopener noreferrer" aria-label="GitHub"><svg xmlns="http://www.w3.org/2000/svg" width="20" height="20" viewBox="0 0 24 24" fill="currentColor"><path d="M12 0c-6.626 0-12 5.373-12 12 0 5.302 3.438 9.8 8.207 11.387.599.111.793-.261.793-.577v-2.234c-3.338.726-4.033-1.416-4.033-1.416-.546-1.387-1.333-1.756-1.333-1.756-1.089-.745.083-.729.083-.729 1.205.084 1.839 1.237 1.839 1.237 1.07 1.834 2.807 1.304 3.492.997.107-.775.418-1.305.762-1.604-2.665-.305-5.467-1.334-5.467-5.931 0-1.311.469-2.381 1.236-3.221-.124-.303-.535-1.524.117-3.176 0 0 1.008-.322 3.301 1.23.957-.266 1.983-.399 3.003-.404 1.02.005 2.047.138 3.006.404 2.291-1.552 3.297-1.23 3.297-1.23.653 1.653.242 2.874.118 3.176.77.84 1.235 1.911 1.235 3.221 0 4.609-2.807 5.624-5.479 5.921.43.372.823 1.102.823 2.222v3.293c0 .319.192.694.801.576 4.765-1.589 8.199-6.086 8.199-11.386 0-6.627-5.373-12-12-12z"></path></svg></a></div><button class="mobile-menu-button" aria-label="Toggle navigation menu" aria-expanded="false"><span class="hamburger-line"></span><span class="hamburger-line"></span><span class="hamburger-line"></span></button></div></header><div class="mobile-menu"><nav class="mobile-menu-nav"><div class="mobile-menu-section"><a href="/guide/index.html" class="mobile-menu-section-title ">Guide</a><ul class="mobile-menu-list"><li><a href="/guide/index.html" class="mobile-menu-link ">What is Org-Press?</a></li><li><a href="/guide/getting-started.html" class="mobile-menu-link ">Getting Started</a></li><li><a href="/guide/why-org-press.html" class="mobile-menu-link ">Why Org-Press?</a></li><li><a href="/guide/features.html" class="mobile-menu-link ">Features</a></li><li><a href="/guide/rendering-modes.html" class="mobile-menu-link ">Rendering Modes</a></li><li><a href="/guide/cli.html" class="mobile-menu-link ">CLI Reference</a></li><li><a href="/guide/using-plugins.html" class="mobile-menu-link ">Using Plugins</a></li><li><a href="/guide/block-imports.html" class="mobile-menu-link ">Block Imports</a></li><li><a href="/guide/static-assets.html" class="mobile-menu-link ">Static Assets</a></li><li><a href="/guide/building.html" class="mobile-menu-link ">Building for Production</a></li><li><a href="/guide/deploying.html" class="mobile-menu-link ">Deploying</a></li><li><a href="/guide/troubleshooting.html" class="mobile-menu-link ">Troubleshooting</a></li></ul></div><div class="mobile-menu-section"><a href="/config/index.html" class="mobile-menu-section-title ">Config</a><ul class="mobile-menu-list"><li><a href="/config/index.html" class="mobile-menu-link ">Overview</a></li><li><a href="/config/shared-options.html" class="mobile-menu-link ">Shared Options</a></li><li><a href="/config/build-options.html" class="mobile-menu-link ">Build Options</a></li><li><a href="/config/server-options.html" class="mobile-menu-link ">Server Options</a></li><li><a href="/config/plugin-options.html" class="mobile-menu-link ">Plugin Options</a></li></ul></div><div class="mobile-menu-section"><a href="/plugins/index.html" class="mobile-menu-section-title ">Plugins</a><ul class="mobile-menu-list"><li><a href="/plugins/index.html" class="mobile-menu-link ">Overview</a></li><li class="mobile-menu-group"><span class="mobile-menu-group-title">Official Plugins</span><ul class="mobile-menu-sublist"><li><a href="/plugins/react.html" class="mobile-menu-link ">React</a></li><li><a href="/plugins/echarts.html" class="mobile-menu-link ">ECharts</a></li><li><a href="/plugins/excalidraw.html" class="mobile-menu-link ">Excalidraw</a></li><li><a href="/plugins/jscad.html" class="mobile-menu-link ">JSCAD</a></li><li><a href="/plugins/test.html" class="mobile-menu-link ">Test</a></li></ul></li><li><a href="/plugins/creating-plugins.html" class="mobile-menu-link ">Creating Plugins</a></li></ul></div><div class="mobile-menu-section"><a href="/api/index.html" class="mobile-menu-section-title ">API</a><ul class="mobile-menu-list"><li><a href="/api/index.html" class="mobile-menu-link ">Overview</a></li><li><a href="/api/plugin-api.html" class="mobile-menu-link ">Plugin API</a></li><li><a href="/api/javascript-api.html" class="mobile-menu-link ">JavaScript API</a></li><li><a href="/api/hmr-api.html" class="mobile-menu-link ">HMR API</a></li><li><a href="/api/cli-plugins.html" class="mobile-menu-link ">CLI Plugins</a></li></ul></div></nav><div class="mobile-menu-footer"><a href="https://github.com/org-press/org-press" class="mobile-menu-link" target="_blank" rel="noopener noreferrer">GitHub</a></div></div><div class="alpha-banner"><span class="alpha-banner-icon">⚠️</span><span class="alpha-banner-text"><strong>Early Alpha</strong> — Org-press is experimental. Perfect for hackers and tinkerers, not ready for production. Documentation may be incomplete or inaccurate.</span></div><div class="docs-container"><aside class="sidebar"><div class="sidebar-content"><nav class="sidebar-nav" aria-label="Section navigation"><div class="sidebar-section"><h3 class="sidebar-section-title">Guide</h3><ul class="sidebar-list"><li class="sidebar-item "><a href="/guide/index.html" class="sidebar-link ">What is Org-Press?</a></li><li class="sidebar-item "><a href="/guide/getting-started.html" class="sidebar-link ">Getting Started</a></li><li class="sidebar-item "><a href="/guide/why-org-press.html" class="sidebar-link ">Why Org-Press?</a></li><li class="sidebar-item "><a href="/guide/features.html" class="sidebar-link ">Features</a></li><li class="sidebar-item "><a href="/guide/rendering-modes.html" class="sidebar-link ">Rendering Modes</a></li><li class="sidebar-item "><a href="/guide/cli.html" class="sidebar-link ">CLI Reference</a></li><li class="sidebar-item "><a href="/guide/using-plugins.html" class="sidebar-link ">Using Plugins</a></li><li class="sidebar-item "><a href="/guide/block-imports.html" class="sidebar-link ">Block Imports</a></li><li class="sidebar-item "><a href="/guide/static-assets.html" class="sidebar-link ">Static Assets</a></li><li class="sidebar-item "><a href="/guide/building.html" class="sidebar-link ">Building for Production</a></li><li class="sidebar-item "><a href="/guide/deploying.html" class="sidebar-link ">Deploying</a></li><li class="sidebar-item "><a href="/guide/troubleshooting.html" class="sidebar-link ">Troubleshooting</a></li></ul></div></nav></div></aside><main class="docs-content"><article class="docs-article"><div class="docs-body"><div><h1 id="introduction">Introduction</h1><p>Org-Press supports a powerful <strong>block import</strong> system that allows you to import and reuse code blocks across org files, enabling true literate programming and code composition.
</p><h2 id="what-youll-learn">What You'll Learn</h2><p>This comprehensive guide demonstrates:
</p><ul><li>Importing blocks from other files by name
</li><li>Importing blocks by index position
</li><li>Self-importing within the same file
</li><li>Composing complex functionality from simple blocks
</li><li>Cross-file code sharing and reusability
</li><li>Server-side and client-side imports
</li><li>3D modeling with imported geometry
</li></ul><h2 id="import-syntax">Import Syntax</h2><p>The import syntax uses special query parameters:
</p><pre><code>// Import by name
import { function } from './file.org?name=block-name';

// Import by index (0-based)
import { function } from './file.org?index=0';

// Import default export
import value from './file.org?name=block-name';
</code></pre>
<h2 id="the-library-file">The Library File</h2><p>This guide uses <a href="/examples/block-import-library.html">block-import-library.org</a> as a shared library of reusable utilities, demonstrating cross-file imports. The library contains:
</p><ul><li>JavaScript utilities (math, string manipulation)
</li><li>CSS utilities (flexbox, animations)
</li><li>JSCad geometry primitives and composite shapes
</li><li>Server-side data processing
</li><li>TypeScript type-safe utilities
</li></ul><h1 id="part-1-self-import-same-file">Part 1: Self-Import (Same File)</h1><p>Before exploring cross-file imports, let's see how blocks can import from the same file.
</p><h2 id="define-a-local-helper">Define a Local Helper</h2><p>First, let's define a helper block in this file:
</p><div id="org-block-0-result" data-org-block="block-content-examples-block-imports-org-0" class="org-block-result"></div><h2 id="use-the-local-helper">Use the Local Helper</h2><p>Now we import and use it from another block in this same file:
</p><pre class="src-block"><code class="hljs language-javascript"><span class="hljs-comment">// Import from this same file using self-reference</span>
<span class="hljs-keyword">import</span> { formatMessage, getTimestamp } <span class="hljs-keyword">from</span> <span class="hljs-string">'./block-imports.org?name=local-helper'</span>;

<span class="hljs-keyword">const</span> greeting = <span class="hljs-title function_">formatMessage</span>(<span class="hljs-string">'Developer'</span>);
<span class="hljs-keyword">const</span> timestamp = <span class="hljs-title function_">getTimestamp</span>();

<span class="hljs-keyword">const</span> container = <span class="hljs-variable language_">document</span>.<span class="hljs-title function_">createElement</span>(<span class="hljs-string">'div'</span>);
container.<span class="hljs-property">style</span>.<span class="hljs-property">cssText</span> = <span class="hljs-string">'padding: 1rem; background: #e3f2fd; border-radius: 8px; margin: 1rem 0;'</span>;
container.<span class="hljs-property">innerHTML</span> = <span class="hljs-string">`
  &#x3C;h4 style="margin-top: 0; color: #1976d2;">Self-Import Demo&#x3C;/h4>
  &#x3C;p><span class="hljs-subst">${greeting}</span>&#x3C;/p>
  &#x3C;p>&#x3C;small>Generated at: <span class="hljs-subst">${timestamp}</span>&#x3C;/small>&#x3C;/p>
`</span>;

<span class="hljs-keyword">export</span> <span class="hljs-keyword">default</span> container;
</code></pre><div id="org-block-1-result" data-org-block="block-content-examples-block-imports-org-1" class="org-block-result"></div>
<div class="org-source-code">
        <div class="org-source-label">Source</div>
        <pre><code class="hljs language-javascript"><span class="hljs-comment">// Import from this same file using self-reference</span>
<span class="hljs-keyword">import</span> { formatMessage, getTimestamp } <span class="hljs-keyword">from</span> <span class="hljs-string">'./block-imports.org?name=local-helper'</span>;

<span class="hljs-keyword">const</span> greeting = <span class="hljs-title function_">formatMessage</span>(<span class="hljs-string">'Developer'</span>);
<span class="hljs-keyword">const</span> timestamp = <span class="hljs-title function_">getTimestamp</span>();

<span class="hljs-keyword">const</span> container = <span class="hljs-variable language_">document</span>.<span class="hljs-title function_">createElement</span>(<span class="hljs-string">'div'</span>);
container.<span class="hljs-property">style</span>.<span class="hljs-property">cssText</span> = <span class="hljs-string">'padding: 1rem; background: #e3f2fd; border-radius: 8px; margin: 1rem 0;'</span>;
container.<span class="hljs-property">innerHTML</span> = <span class="hljs-string">`
  &#x3C;h4 style="margin-top: 0; color: #1976d2;">Self-Import Demo&#x3C;/h4>
  &#x3C;p><span class="hljs-subst">${greeting}</span>&#x3C;/p>
  &#x3C;p>&#x3C;small>Generated at: <span class="hljs-subst">${timestamp}</span>&#x3C;/small>&#x3C;/p>
`</span>;

<span class="hljs-keyword">export</span> <span class="hljs-keyword">default</span> container;
</code></pre>
