docs/content/examples/block-imports.org
** Why Self-Import?

Self-importing is useful for:
- Breaking down complex code into manageable pieces
- Reusing helper functions within the same document
- Creating a library section at the top of your file
- Maintaining literate programming principles

* Part 2: Cross-File JavaScript Imports

Now let's import from our external library file.

** Math Utilities

Import and use mathematical functions:

#+begin_src javascript :use dom | withSourceCode
import { add, multiply, fibonacci } from './block-import-library.org?name=math-utils';

const results = document.createElement('div');
results.style.cssText = 'padding: 1rem; background: #f3e5f5; border-radius: 8px; margin: 1rem 0;';
results.innerHTML = `
  <h4 style="margin-top: 0; color: #7b1fa2;">Math Utils from Library</h4>
  <ul style="margin: 0;">
    <li>add(5, 3) = ${add(5, 3)}</li>
    <li>multiply(4, 7) = ${multiply(4, 7)}</li>
    <li>fibonacci(10) = ${fibonacci(10)}</li>
  </ul>
`;

export default results;
#+end_src

** String Utilities

Import string manipulation functions:

#+begin_src javascript :use dom | withSourceCode
import { capitalize, slugify, truncate } from './block-import-library.org?name=string-utils';

const results = document.createElement('div');
results.style.cssText = 'padding: 1rem; background: #e8f5e9; border-radius: 8px; margin: 1rem 0;';

const examples = [
  { input: 'hello world', fn: 'capitalize', output: capitalize('hello world') },
  { input: 'Hello World 2024!', fn: 'slugify', output: slugify('Hello World 2024!') },
  { input: 'This is a very long string...', fn: 'truncate(20)', output: truncate('This is a very long string that needs truncation', 20) }
];

results.innerHTML = `
  <h4 style="margin-top: 0; color: #388e3c;">String Utils from Library</h4>
  <table style="width: 100%; border-collapse: collapse;">
    <tr><th>Function</th><th>Input</th><th>Output</th></tr>
    ${examples.map(ex => `
      <tr>
        <td><code>${ex.fn}</code></td>
        <td>${ex.input}</td>
        <td><strong>${ex.output}</strong></td>
      </tr>
    `).join('')}
  </table>
`;

export default results;
#+end_src

* Part 3: CSS Imports

CSS blocks can be imported as strings and dynamically injected.

