examples/block-imports.html
      </div><h2 id="why-self-import">Why Self-Import?</h2><p>Self-importing is useful for:
</p><ul><li>Breaking down complex code into manageable pieces
</li><li>Reusing helper functions within the same document
</li><li>Creating a library section at the top of your file
</li><li>Maintaining literate programming principles
</li></ul><h1 id="part-2-cross-file-javascript-imports">Part 2: Cross-File JavaScript Imports</h1><p>Now let's import from our external library file.
</p><h2 id="math-utilities">Math Utilities</h2><p>Import and use mathematical functions:
</p><pre class="src-block"><code class="hljs language-javascript"><span class="hljs-keyword">import</span> { add, multiply, fibonacci } <span class="hljs-keyword">from</span> <span class="hljs-string">'./block-import-library.org?name=math-utils'</span>;

<span class="hljs-keyword">const</span> results = <span class="hljs-variable language_">document</span>.<span class="hljs-title function_">createElement</span>(<span class="hljs-string">'div'</span>);
results.<span class="hljs-property">style</span>.<span class="hljs-property">cssText</span> = <span class="hljs-string">'padding: 1rem; background: #f3e5f5; border-radius: 8px; margin: 1rem 0;'</span>;
results.<span class="hljs-property">innerHTML</span> = <span class="hljs-string">`
  &#x3C;h4 style="margin-top: 0; color: #7b1fa2;">Math Utils from Library&#x3C;/h4>
  &#x3C;ul style="margin: 0;">
    &#x3C;li>add(5, 3) = <span class="hljs-subst">${add(<span class="hljs-number">5</span>, <span class="hljs-number">3</span>)}</span>&#x3C;/li>
    &#x3C;li>multiply(4, 7) = <span class="hljs-subst">${multiply(<span class="hljs-number">4</span>, <span class="hljs-number">7</span>)}</span>&#x3C;/li>
    &#x3C;li>fibonacci(10) = <span class="hljs-subst">${fibonacci(<span class="hljs-number">10</span>)}</span>&#x3C;/li>
  &#x3C;/ul>
`</span>;

<span class="hljs-keyword">export</span> <span class="hljs-keyword">default</span> results;
</code></pre><div id="org-block-2-result" data-org-block="block-content-examples-block-imports-org-2" class="org-block-result"></div>
<div class="org-source-code">
        <div class="org-source-label">Source</div>
        <pre><code class="hljs language-javascript"><span class="hljs-keyword">import</span> { add, multiply, fibonacci } <span class="hljs-keyword">from</span> <span class="hljs-string">'./block-import-library.org?name=math-utils'</span>;

<span class="hljs-keyword">const</span> results = <span class="hljs-variable language_">document</span>.<span class="hljs-title function_">createElement</span>(<span class="hljs-string">'div'</span>);
results.<span class="hljs-property">style</span>.<span class="hljs-property">cssText</span> = <span class="hljs-string">'padding: 1rem; background: #f3e5f5; border-radius: 8px; margin: 1rem 0;'</span>;
results.<span class="hljs-property">innerHTML</span> = <span class="hljs-string">`
  &#x3C;h4 style="margin-top: 0; color: #7b1fa2;">Math Utils from Library&#x3C;/h4>
  &#x3C;ul style="margin: 0;">
    &#x3C;li>add(5, 3) = <span class="hljs-subst">${add(<span class="hljs-number">5</span>, <span class="hljs-number">3</span>)}</span>&#x3C;/li>
    &#x3C;li>multiply(4, 7) = <span class="hljs-subst">${multiply(<span class="hljs-number">4</span>, <span class="hljs-number">7</span>)}</span>&#x3C;/li>
    &#x3C;li>fibonacci(10) = <span class="hljs-subst">${fibonacci(<span class="hljs-number">10</span>)}</span>&#x3C;/li>
  &#x3C;/ul>
`</span>;

<span class="hljs-keyword">export</span> <span class="hljs-keyword">default</span> results;
</code></pre>
      </div><h2 id="string-utilities">String Utilities</h2><p>Import string manipulation functions:
</p><pre class="src-block"><code class="hljs language-javascript"><span class="hljs-keyword">import</span> { capitalize, slugify, truncate } <span class="hljs-keyword">from</span> <span class="hljs-string">'./block-import-library.org?name=string-utils'</span>;

<span class="hljs-keyword">const</span> results = <span class="hljs-variable language_">document</span>.<span class="hljs-title function_">createElement</span>(<span class="hljs-string">'div'</span>);
results.<span class="hljs-property">style</span>.<span class="hljs-property">cssText</span> = <span class="hljs-string">'padding: 1rem; background: #e8f5e9; border-radius: 8px; margin: 1rem 0;'</span>;

<span class="hljs-keyword">const</span> examples = [
  { <span class="hljs-attr">input</span>: <span class="hljs-string">'hello world'</span>, <span class="hljs-attr">fn</span>: <span class="hljs-string">'capitalize'</span>, <span class="hljs-attr">output</span>: <span class="hljs-title function_">capitalize</span>(<span class="hljs-string">'hello world'</span>) },
  { <span class="hljs-attr">input</span>: <span class="hljs-string">'Hello World 2024!'</span>, <span class="hljs-attr">fn</span>: <span class="hljs-string">'slugify'</span>, <span class="hljs-attr">output</span>: <span class="hljs-title function_">slugify</span>(<span class="hljs-string">'Hello World 2024!'</span>) },
  { <span class="hljs-attr">input</span>: <span class="hljs-string">'This is a very long string...'</span>, <span class="hljs-attr">fn</span>: <span class="hljs-string">'truncate(20)'</span>, <span class="hljs-attr">output</span>: <span class="hljs-title function_">truncate</span>(<span class="hljs-string">'This is a very long string that needs truncation'</span>, <span class="hljs-number">20</span>) }
];

results.<span class="hljs-property">innerHTML</span> = <span class="hljs-string">`
  &#x3C;h4 style="margin-top: 0; color: #388e3c;">String Utils from Library&#x3C;/h4>
  &#x3C;table style="width: 100%; border-collapse: collapse;">
    &#x3C;tr>&#x3C;th>Function&#x3C;/th>&#x3C;th>Input&#x3C;/th>&#x3C;th>Output&#x3C;/th>&#x3C;/tr>
    <span class="hljs-subst">${examples.map(ex => <span class="hljs-string">`
      &#x3C;tr>
        &#x3C;td>&#x3C;code><span class="hljs-subst">${ex.fn}</span>&#x3C;/code>&#x3C;/td>
        &#x3C;td><span class="hljs-subst">${ex.input}</span>&#x3C;/td>
        &#x3C;td>&#x3C;strong><span class="hljs-subst">${ex.output}</span>&#x3C;/strong>&#x3C;/td>
      &#x3C;/tr>
    `</span>).join(<span class="hljs-string">''</span>)}</span>
  &#x3C;/table>
`</span>;

<span class="hljs-keyword">export</span> <span class="hljs-keyword">default</span> results;
</code></pre><div id="org-block-3-result" data-org-block="block-content-examples-block-imports-org-3" class="org-block-result"></div>
<div class="org-source-code">
        <div class="org-source-label">Source</div>
        <pre><code class="hljs language-javascript"><span class="hljs-keyword">import</span> { capitalize, slugify, truncate } <span class="hljs-keyword">from</span> <span class="hljs-string">'./block-import-library.org?name=string-utils'</span>;

<span class="hljs-keyword">const</span> results = <span class="hljs-variable language_">document</span>.<span class="hljs-title function_">createElement</span>(<span class="hljs-string">'div'</span>);
results.<span class="hljs-property">style</span>.<span class="hljs-property">cssText</span> = <span class="hljs-string">'padding: 1rem; background: #e8f5e9; border-radius: 8px; margin: 1rem 0;'</span>;

<span class="hljs-keyword">const</span> examples = [
  { <span class="hljs-attr">input</span>: <span class="hljs-string">'hello world'</span>, <span class="hljs-attr">fn</span>: <span class="hljs-string">'capitalize'</span>, <span class="hljs-attr">output</span>: <span class="hljs-title function_">capitalize</span>(<span class="hljs-string">'hello world'</span>) },
  { <span class="hljs-attr">input</span>: <span class="hljs-string">'Hello World 2024!'</span>, <span class="hljs-attr">fn</span>: <span class="hljs-string">'slugify'</span>, <span class="hljs-attr">output</span>: <span class="hljs-title function_">slugify</span>(<span class="hljs-string">'Hello World 2024!'</span>) },
  { <span class="hljs-attr">input</span>: <span class="hljs-string">'This is a very long string...'</span>, <span class="hljs-attr">fn</span>: <span class="hljs-string">'truncate(20)'</span>, <span class="hljs-attr">output</span>: <span class="hljs-title function_">truncate</span>(<span class="hljs-string">'This is a very long string that needs truncation'</span>, <span class="hljs-number">20</span>) }
];

results.<span class="hljs-property">innerHTML</span> = <span class="hljs-string">`
  &#x3C;h4 style="margin-top: 0; color: #388e3c;">String Utils from Library&#x3C;/h4>
  &#x3C;table style="width: 100%; border-collapse: collapse;">
    &#x3C;tr>&#x3C;th>Function&#x3C;/th>&#x3C;th>Input&#x3C;/th>&#x3C;th>Output&#x3C;/th>&#x3C;/tr>
    <span class="hljs-subst">${examples.map(ex => <span class="hljs-string">`
      &#x3C;tr>
        &#x3C;td>&#x3C;code><span class="hljs-subst">${ex.fn}</span>&#x3C;/code>&#x3C;/td>
        &#x3C;td><span class="hljs-subst">${ex.input}</span>&#x3C;/td>
        &#x3C;td>&#x3C;strong><span class="hljs-subst">${ex.output}</span>&#x3C;/strong>&#x3C;/td>
      &#x3C;/tr>
    `</span>).join(<span class="hljs-string">''</span>)}</span>
  &#x3C;/table>
`</span>;

<span class="hljs-keyword">export</span> <span class="hljs-keyword">default</span> results;
</code></pre>
      </div><h1 id="part-3-css-imports">Part 3: CSS Imports</h1><p>CSS blocks can be imported as strings and dynamically injected.
