docs/content/examples/block-imports.org
** Flexbox Utilities

#+begin_src html :use dom | withSourceCode
<style>
  /* We'll inject CSS utilities from the library */
</style>
<script type="module">
  import flexUtils from './block-import-library.org?name=flex-utils';

  // Inject the imported CSS
  const style = document.createElement('style');
  style.textContent = flexUtils;
  document.head.appendChild(style);
</script>

<div class="flex-between" style="background: #e8f5e9; padding: 1rem; border-radius: 8px; margin: 1rem 0;">
  <div>
    <h4 style="margin: 0; color: #388e3c;">CSS Flexbox Utils from Library</h4>
    <p style="margin: 0.5rem 0 0 0;">Using imported .flex-between and .flex-column classes</p>
  </div>
  <div class="flex-column flex-gap-2">
    <button style="padding: 0.5rem 1rem; border-radius: 4px; border: 1px solid #4caf50; background: white; cursor: pointer;">Button 1</button>
    <button style="padding: 0.5rem 1rem; border-radius: 4px; border: 1px solid #4caf50; background: white; cursor: pointer;">Button 2</button>
  </div>
</div>
#+end_src

** Animation Utilities

#+begin_src html :use dom | withSourceCode
<script type="module">
  import animations from './block-import-library.org?name=animation-utils';

  const style = document.createElement('style');
  style.textContent = animations;
  document.head.appendChild(style);
</script>

<div class="fade-in" style="background: #fff3e0; padding: 1rem; border-radius: 8px; margin: 1rem 0;">
  <h4 style="margin-top: 0; color: #f57c00;">Animated Content</h4>
  <p>This box uses the <code>.fade-in</code> animation imported from the library.</p>
  <div class="spin" style="display: inline-block; font-size: 2rem;">⚙️</div>
</div>
#+end_src

