examples/block-imports.html
</p><h2 id="flexbox-utilities">Flexbox Utilities</h2><pre class="src-block"><code class="hljs language-html"><span class="hljs-tag">&#x3C;<span class="hljs-name">style</span>></span><span class="css">
  <span class="hljs-comment">/* We'll inject CSS utilities from the library */</span>
</span><span class="hljs-tag">&#x3C;/<span class="hljs-name">style</span>></span>
<span class="hljs-tag">&#x3C;<span class="hljs-name">script</span> <span class="hljs-attr">type</span>=<span class="hljs-string">"module"</span>></span><span class="javascript">
  <span class="hljs-keyword">import</span> flexUtils <span class="hljs-keyword">from</span> <span class="hljs-string">'./block-import-library.org?name=flex-utils'</span>;

  <span class="hljs-comment">// Inject the imported CSS</span>
  <span class="hljs-keyword">const</span> style = <span class="hljs-variable language_">document</span>.<span class="hljs-title function_">createElement</span>(<span class="hljs-string">'style'</span>);
  style.<span class="hljs-property">textContent</span> = flexUtils;
  <span class="hljs-variable language_">document</span>.<span class="hljs-property">head</span>.<span class="hljs-title function_">appendChild</span>(style);
</span><span class="hljs-tag">&#x3C;/<span class="hljs-name">script</span>></span>

<span class="hljs-tag">&#x3C;<span class="hljs-name">div</span> <span class="hljs-attr">class</span>=<span class="hljs-string">"flex-between"</span> <span class="hljs-attr">style</span>=<span class="hljs-string">"background: #e8f5e9; padding: 1rem; border-radius: 8px; margin: 1rem 0;"</span>></span>
  <span class="hljs-tag">&#x3C;<span class="hljs-name">div</span>></span>
    <span class="hljs-tag">&#x3C;<span class="hljs-name">h4</span> <span class="hljs-attr">style</span>=<span class="hljs-string">"margin: 0; color: #388e3c;"</span>></span>CSS Flexbox Utils from Library<span class="hljs-tag">&#x3C;/<span class="hljs-name">h4</span>></span>
    <span class="hljs-tag">&#x3C;<span class="hljs-name">p</span> <span class="hljs-attr">style</span>=<span class="hljs-string">"margin: 0.5rem 0 0 0;"</span>></span>Using imported .flex-between and .flex-column classes<span class="hljs-tag">&#x3C;/<span class="hljs-name">p</span>></span>
  <span class="hljs-tag">&#x3C;/<span class="hljs-name">div</span>></span>
  <span class="hljs-tag">&#x3C;<span class="hljs-name">div</span> <span class="hljs-attr">class</span>=<span class="hljs-string">"flex-column flex-gap-2"</span>></span>
    <span class="hljs-tag">&#x3C;<span class="hljs-name">button</span> <span class="hljs-attr">style</span>=<span class="hljs-string">"padding: 0.5rem 1rem; border-radius: 4px; border: 1px solid #4caf50; background: white; cursor: pointer;"</span>></span>Button 1<span class="hljs-tag">&#x3C;/<span class="hljs-name">button</span>></span>
    <span class="hljs-tag">&#x3C;<span class="hljs-name">button</span> <span class="hljs-attr">style</span>=<span class="hljs-string">"padding: 0.5rem 1rem; border-radius: 4px; border: 1px solid #4caf50; background: white; cursor: pointer;"</span>></span>Button 2<span class="hljs-tag">&#x3C;/<span class="hljs-name">button</span>></span>
  <span class="hljs-tag">&#x3C;/<span class="hljs-name">div</span>></span>
<span class="hljs-tag">&#x3C;/<span class="hljs-name">div</span>></span>
</code></pre><div id="org-block-4-result" data-org-block="block-content-examples-block-imports-org-4" class="org-block-result"></div>
<div class="org-source-code">
        <div class="org-source-label">Source</div>
        <pre><code class="hljs language-html"><span class="hljs-tag">&#x3C;<span class="hljs-name">style</span>></span><span class="css">
  <span class="hljs-comment">/* We'll inject CSS utilities from the library */</span>
</span><span class="hljs-tag">&#x3C;/<span class="hljs-name">style</span>></span>
<span class="hljs-tag">&#x3C;<span class="hljs-name">script</span> <span class="hljs-attr">type</span>=<span class="hljs-string">"module"</span>></span><span class="javascript">
  <span class="hljs-keyword">import</span> flexUtils <span class="hljs-keyword">from</span> <span class="hljs-string">'./block-import-library.org?name=flex-utils'</span>;

  <span class="hljs-comment">// Inject the imported CSS</span>
  <span class="hljs-keyword">const</span> style = <span class="hljs-variable language_">document</span>.<span class="hljs-title function_">createElement</span>(<span class="hljs-string">'style'</span>);
  style.<span class="hljs-property">textContent</span> = flexUtils;
  <span class="hljs-variable language_">document</span>.<span class="hljs-property">head</span>.<span class="hljs-title function_">appendChild</span>(style);
</span><span class="hljs-tag">&#x3C;/<span class="hljs-name">script</span>></span>

<span class="hljs-tag">&#x3C;<span class="hljs-name">div</span> <span class="hljs-attr">class</span>=<span class="hljs-string">"flex-between"</span> <span class="hljs-attr">style</span>=<span class="hljs-string">"background: #e8f5e9; padding: 1rem; border-radius: 8px; margin: 1rem 0;"</span>></span>
  <span class="hljs-tag">&#x3C;<span class="hljs-name">div</span>></span>
    <span class="hljs-tag">&#x3C;<span class="hljs-name">h4</span> <span class="hljs-attr">style</span>=<span class="hljs-string">"margin: 0; color: #388e3c;"</span>></span>CSS Flexbox Utils from Library<span class="hljs-tag">&#x3C;/<span class="hljs-name">h4</span>></span>
    <span class="hljs-tag">&#x3C;<span class="hljs-name">p</span> <span class="hljs-attr">style</span>=<span class="hljs-string">"margin: 0.5rem 0 0 0;"</span>></span>Using imported .flex-between and .flex-column classes<span class="hljs-tag">&#x3C;/<span class="hljs-name">p</span>></span>
  <span class="hljs-tag">&#x3C;/<span class="hljs-name">div</span>></span>
  <span class="hljs-tag">&#x3C;<span class="hljs-name">div</span> <span class="hljs-attr">class</span>=<span class="hljs-string">"flex-column flex-gap-2"</span>></span>
    <span class="hljs-tag">&#x3C;<span class="hljs-name">button</span> <span class="hljs-attr">style</span>=<span class="hljs-string">"padding: 0.5rem 1rem; border-radius: 4px; border: 1px solid #4caf50; background: white; cursor: pointer;"</span>></span>Button 1<span class="hljs-tag">&#x3C;/<span class="hljs-name">button</span>></span>
    <span class="hljs-tag">&#x3C;<span class="hljs-name">button</span> <span class="hljs-attr">style</span>=<span class="hljs-string">"padding: 0.5rem 1rem; border-radius: 4px; border: 1px solid #4caf50; background: white; cursor: pointer;"</span>></span>Button 2<span class="hljs-tag">&#x3C;/<span class="hljs-name">button</span>></span>
  <span class="hljs-tag">&#x3C;/<span class="hljs-name">div</span>></span>
<span class="hljs-tag">&#x3C;/<span class="hljs-name">div</span>></span>
</code></pre>
      </div><h2 id="animation-utilities">Animation Utilities</h2><pre class="src-block"><code class="hljs language-html"><span class="hljs-tag">&#x3C;<span class="hljs-name">script</span> <span class="hljs-attr">type</span>=<span class="hljs-string">"module"</span>></span><span class="javascript">
  <span class="hljs-keyword">import</span> animations <span class="hljs-keyword">from</span> <span class="hljs-string">'./block-import-library.org?name=animation-utils'</span>;

  <span class="hljs-keyword">const</span> style = <span class="hljs-variable language_">document</span>.<span class="hljs-title function_">createElement</span>(<span class="hljs-string">'style'</span>);
  style.<span class="hljs-property">textContent</span> = animations;
  <span class="hljs-variable language_">document</span>.<span class="hljs-property">head</span>.<span class="hljs-title function_">appendChild</span>(style);
</span><span class="hljs-tag">&#x3C;/<span class="hljs-name">script</span>></span>

<span class="hljs-tag">&#x3C;<span class="hljs-name">div</span> <span class="hljs-attr">class</span>=<span class="hljs-string">"fade-in"</span> <span class="hljs-attr">style</span>=<span class="hljs-string">"background: #fff3e0; padding: 1rem; border-radius: 8px; margin: 1rem 0;"</span>></span>
  <span class="hljs-tag">&#x3C;<span class="hljs-name">h4</span> <span class="hljs-attr">style</span>=<span class="hljs-string">"margin-top: 0; color: #f57c00;"</span>></span>Animated Content<span class="hljs-tag">&#x3C;/<span class="hljs-name">h4</span>></span>
  <span class="hljs-tag">&#x3C;<span class="hljs-name">p</span>></span>This box uses the <span class="hljs-tag">&#x3C;<span class="hljs-name">code</span>></span>.fade-in<span class="hljs-tag">&#x3C;/<span class="hljs-name">code</span>></span> animation imported from the library.<span class="hljs-tag">&#x3C;/<span class="hljs-name">p</span>></span>
  <span class="hljs-tag">&#x3C;<span class="hljs-name">div</span> <span class="hljs-attr">class</span>=<span class="hljs-string">"spin"</span> <span class="hljs-attr">style</span>=<span class="hljs-string">"display: inline-block; font-size: 2rem;"</span>></span>⚙️<span class="hljs-tag">&#x3C;/<span class="hljs-name">div</span>></span>
<span class="hljs-tag">&#x3C;/<span class="hljs-name">div</span>></span>
</code></pre><div id="org-block-5-result" data-org-block="block-content-examples-block-imports-org-5" class="org-block-result"></div>
<div class="org-source-code">
        <div class="org-source-label">Source</div>
        <pre><code class="hljs language-html"><span class="hljs-tag">&#x3C;<span class="hljs-name">script</span> <span class="hljs-attr">type</span>=<span class="hljs-string">"module"</span>></span><span class="javascript">
  <span class="hljs-keyword">import</span> animations <span class="hljs-keyword">from</span> <span class="hljs-string">'./block-import-library.org?name=animation-utils'</span>;

  <span class="hljs-keyword">const</span> style = <span class="hljs-variable language_">document</span>.<span class="hljs-title function_">createElement</span>(<span class="hljs-string">'style'</span>);
  style.<span class="hljs-property">textContent</span> = animations;
  <span class="hljs-variable language_">document</span>.<span class="hljs-property">head</span>.<span class="hljs-title function_">appendChild</span>(style);
</span><span class="hljs-tag">&#x3C;/<span class="hljs-name">script</span>></span>

<span class="hljs-tag">&#x3C;<span class="hljs-name">div</span> <span class="hljs-attr">class</span>=<span class="hljs-string">"fade-in"</span> <span class="hljs-attr">style</span>=<span class="hljs-string">"background: #fff3e0; padding: 1rem; border-radius: 8px; margin: 1rem 0;"</span>></span>
  <span class="hljs-tag">&#x3C;<span class="hljs-name">h4</span> <span class="hljs-attr">style</span>=<span class="hljs-string">"margin-top: 0; color: #f57c00;"</span>></span>Animated Content<span class="hljs-tag">&#x3C;/<span class="hljs-name">h4</span>></span>
  <span class="hljs-tag">&#x3C;<span class="hljs-name">p</span>></span>This box uses the <span class="hljs-tag">&#x3C;<span class="hljs-name">code</span>></span>.fade-in<span class="hljs-tag">&#x3C;/<span class="hljs-name">code</span>></span> animation imported from the library.<span class="hljs-tag">&#x3C;/<span class="hljs-name">p</span>></span>
  <span class="hljs-tag">&#x3C;<span class="hljs-name">div</span> <span class="hljs-attr">class</span>=<span class="hljs-string">"spin"</span> <span class="hljs-attr">style</span>=<span class="hljs-string">"display: inline-block; font-size: 2rem;"</span>></span>⚙️<span class="hljs-tag">&#x3C;/<span class="hljs-name">div</span>></span>
<span class="hljs-tag">&#x3C;/<span class="hljs-name">div</span>></span>
</code></pre>
