docs/content/examples/block-imports.org
* Part 4: TypeScript Imports

Import type-safe utilities with full TypeScript support:

#+begin_src javascript :use dom | withSourceCode
import { distance2D, midpoint } from './block-import-library.org?name=type-safe-utils';

const p1 = { x: 0, y: 0 };
const p2 = { x: 3, y: 4 };

const dist = distance2D(p1, p2);
const mid = midpoint(p1, p2);

const container = document.createElement('div');
container.style.cssText = 'padding: 1rem; background: #fff3e0; border-radius: 8px; margin: 1rem 0;';
container.innerHTML = `
  <h4 style="margin-top: 0; color: #f57c00;">TypeScript Utils from Library</h4>
  <p>Point 1: (${p1.x}, ${p1.y})</p>
  <p>Point 2: (${p2.x}, ${p2.y})</p>
  <p>Distance: ${dist.toFixed(2)}</p>
  <p>Midpoint: (${mid.x}, ${mid.y})</p>
`;

export default container;
#+end_src

* Part 5: Import by Index

You can import blocks by their position (0-based index) instead of by name:

#+begin_src javascript :use dom | withSourceCode
// Import the first block from the library (math-utils at index 0)
import { add } from './block-import-library.org?index=0';

const result = document.createElement('div');
result.style.cssText = 'padding: 1rem; background: #fce4ec; border-radius: 8px; margin: 1rem 0;';
result.innerHTML = `
  <h4 style="margin-top: 0; color: #c2185b;">Import by Index Demo</h4>
  <p>Imported first block from library (index=0): <code>math-utils</code></p>
  <p>Result: add(10, 20) = ${add(10, 20)}</p>
`;

export default result;
#+end_src

** When to Use Index vs Name

- **Use names** for stable, semantic imports (recommended)
- **Use indexes** for quick prototyping or when names aren't available
- Names are more maintainable as file structure changes

* Part 6: Server-Side Data Import

Import pre-computed server-side data that runs during the build process:

#+begin_src javascript :use dom | withSourceCode
// Import server-computed file statistics and date
import fileStats from './block-import-library.org?name=file-stats';
import currentDate from './block-import-library.org?name=current-date';

const container = document.createElement('div');
container.style.cssText = 'padding: 1rem; background: #e0f2f1; border-radius: 8px; margin: 1rem 0;';

const stats = JSON.parse(fileStats);

container.innerHTML = `
  <h4 style="margin-top: 0; color: #00796b;">Server-Side Data from Library</h4>
  <p><strong>Build Date:</strong> ${currentDate}</p>
  <p><strong>Total org files:</strong> ${stats.totalFiles}</p>
  <details>
    <summary style="cursor: pointer; color: #00796b; font-weight: bold;">File Details</summary>
    <ul>
      ${stats.files.map(f => `<li>${f.name} - ${(f.size / 1024).toFixed(2)} KB</li>`).join('')}
    </ul>
  </details>
`;

export default container;
#+end_src

** Server-Side Benefits

- Execute expensive operations once at build time
- Access Node.js APIs (fs, path, etc.)
- Generate dynamic content from file system
- No client-side overhead

* Part 7: JSCad 3D Modeling

The most powerful demonstration: importing 3D geometry functions and composing complex scenes.

#+begin_export html
<style>
  .jscad-wrapper {
    position: relative;
    width: 100%;
    height: 400px;
    margin: 1rem 0;
    border-radius: 8px;
    overflow: hidden;
  }
</style>
#+end_export

