examples/block-imports.html
      </div><h1 id="part-4-typescript-imports">Part 4: TypeScript Imports</h1><p>Import type-safe utilities with full TypeScript support:
</p><pre class="src-block"><code class="hljs language-javascript"><span class="hljs-keyword">import</span> { distance2D, midpoint } <span class="hljs-keyword">from</span> <span class="hljs-string">'./block-import-library.org?name=type-safe-utils'</span>;

<span class="hljs-keyword">const</span> p1 = { <span class="hljs-attr">x</span>: <span class="hljs-number">0</span>, <span class="hljs-attr">y</span>: <span class="hljs-number">0</span> };
<span class="hljs-keyword">const</span> p2 = { <span class="hljs-attr">x</span>: <span class="hljs-number">3</span>, <span class="hljs-attr">y</span>: <span class="hljs-number">4</span> };

<span class="hljs-keyword">const</span> dist = <span class="hljs-title function_">distance2D</span>(p1, p2);
<span class="hljs-keyword">const</span> mid = <span class="hljs-title function_">midpoint</span>(p1, p2);

<span class="hljs-keyword">const</span> container = <span class="hljs-variable language_">document</span>.<span class="hljs-title function_">createElement</span>(<span class="hljs-string">'div'</span>);
container.<span class="hljs-property">style</span>.<span class="hljs-property">cssText</span> = <span class="hljs-string">'padding: 1rem; background: #fff3e0; border-radius: 8px; margin: 1rem 0;'</span>;
container.<span class="hljs-property">innerHTML</span> = <span class="hljs-string">`
  &#x3C;h4 style="margin-top: 0; color: #f57c00;">TypeScript Utils from Library&#x3C;/h4>
  &#x3C;p>Point 1: (<span class="hljs-subst">${p1.x}</span>, <span class="hljs-subst">${p1.y}</span>)&#x3C;/p>
  &#x3C;p>Point 2: (<span class="hljs-subst">${p2.x}</span>, <span class="hljs-subst">${p2.y}</span>)&#x3C;/p>
  &#x3C;p>Distance: <span class="hljs-subst">${dist.toFixed(<span class="hljs-number">2</span>)}</span>&#x3C;/p>
  &#x3C;p>Midpoint: (<span class="hljs-subst">${mid.x}</span>, <span class="hljs-subst">${mid.y}</span>)&#x3C;/p>
`</span>;

<span class="hljs-keyword">export</span> <span class="hljs-keyword">default</span> container;
</code></pre><div id="org-block-6-result" data-org-block="block-content-examples-block-imports-org-6" class="org-block-result"></div>
<div class="org-source-code">
        <div class="org-source-label">Source</div>
        <pre><code class="hljs language-javascript"><span class="hljs-keyword">import</span> { distance2D, midpoint } <span class="hljs-keyword">from</span> <span class="hljs-string">'./block-import-library.org?name=type-safe-utils'</span>;

<span class="hljs-keyword">const</span> p1 = { <span class="hljs-attr">x</span>: <span class="hljs-number">0</span>, <span class="hljs-attr">y</span>: <span class="hljs-number">0</span> };
<span class="hljs-keyword">const</span> p2 = { <span class="hljs-attr">x</span>: <span class="hljs-number">3</span>, <span class="hljs-attr">y</span>: <span class="hljs-number">4</span> };

<span class="hljs-keyword">const</span> dist = <span class="hljs-title function_">distance2D</span>(p1, p2);
<span class="hljs-keyword">const</span> mid = <span class="hljs-title function_">midpoint</span>(p1, p2);

<span class="hljs-keyword">const</span> container = <span class="hljs-variable language_">document</span>.<span class="hljs-title function_">createElement</span>(<span class="hljs-string">'div'</span>);
container.<span class="hljs-property">style</span>.<span class="hljs-property">cssText</span> = <span class="hljs-string">'padding: 1rem; background: #fff3e0; border-radius: 8px; margin: 1rem 0;'</span>;
container.<span class="hljs-property">innerHTML</span> = <span class="hljs-string">`
  &#x3C;h4 style="margin-top: 0; color: #f57c00;">TypeScript Utils from Library&#x3C;/h4>
  &#x3C;p>Point 1: (<span class="hljs-subst">${p1.x}</span>, <span class="hljs-subst">${p1.y}</span>)&#x3C;/p>
  &#x3C;p>Point 2: (<span class="hljs-subst">${p2.x}</span>, <span class="hljs-subst">${p2.y}</span>)&#x3C;/p>
  &#x3C;p>Distance: <span class="hljs-subst">${dist.toFixed(<span class="hljs-number">2</span>)}</span>&#x3C;/p>
  &#x3C;p>Midpoint: (<span class="hljs-subst">${mid.x}</span>, <span class="hljs-subst">${mid.y}</span>)&#x3C;/p>
`</span>;

<span class="hljs-keyword">export</span> <span class="hljs-keyword">default</span> container;
</code></pre>
      </div><h1 id="part-5-import-by-index">Part 5: Import by Index</h1><p>You can import blocks by their position (0-based index) instead of by name:
</p><pre class="src-block"><code class="hljs language-javascript"><span class="hljs-comment">// Import the first block from the library (math-utils at index 0)</span>
<span class="hljs-keyword">import</span> { add } <span class="hljs-keyword">from</span> <span class="hljs-string">'./block-import-library.org?index=0'</span>;

<span class="hljs-keyword">const</span> result = <span class="hljs-variable language_">document</span>.<span class="hljs-title function_">createElement</span>(<span class="hljs-string">'div'</span>);
result.<span class="hljs-property">style</span>.<span class="hljs-property">cssText</span> = <span class="hljs-string">'padding: 1rem; background: #fce4ec; border-radius: 8px; margin: 1rem 0;'</span>;
result.<span class="hljs-property">innerHTML</span> = <span class="hljs-string">`
  &#x3C;h4 style="margin-top: 0; color: #c2185b;">Import by Index Demo&#x3C;/h4>
  &#x3C;p>Imported first block from library (index=0): &#x3C;code>math-utils&#x3C;/code>&#x3C;/p>
  &#x3C;p>Result: add(10, 20) = <span class="hljs-subst">${add(<span class="hljs-number">10</span>, <span class="hljs-number">20</span>)}</span>&#x3C;/p>
`</span>;

<span class="hljs-keyword">export</span> <span class="hljs-keyword">default</span> result;
</code></pre><div id="org-block-7-result" data-org-block="block-content-examples-block-imports-org-7" class="org-block-result"></div>
<div class="org-source-code">
        <div class="org-source-label">Source</div>
        <pre><code class="hljs language-javascript"><span class="hljs-comment">// Import the first block from the library (math-utils at index 0)</span>
<span class="hljs-keyword">import</span> { add } <span class="hljs-keyword">from</span> <span class="hljs-string">'./block-import-library.org?index=0'</span>;

<span class="hljs-keyword">const</span> result = <span class="hljs-variable language_">document</span>.<span class="hljs-title function_">createElement</span>(<span class="hljs-string">'div'</span>);
result.<span class="hljs-property">style</span>.<span class="hljs-property">cssText</span> = <span class="hljs-string">'padding: 1rem; background: #fce4ec; border-radius: 8px; margin: 1rem 0;'</span>;
result.<span class="hljs-property">innerHTML</span> = <span class="hljs-string">`
  &#x3C;h4 style="margin-top: 0; color: #c2185b;">Import by Index Demo&#x3C;/h4>
  &#x3C;p>Imported first block from library (index=0): &#x3C;code>math-utils&#x3C;/code>&#x3C;/p>
  &#x3C;p>Result: add(10, 20) = <span class="hljs-subst">${add(<span class="hljs-number">10</span>, <span class="hljs-number">20</span>)}</span>&#x3C;/p>
`</span>;

<span class="hljs-keyword">export</span> <span class="hljs-keyword">default</span> result;
</code></pre>
      </div><h2 id="when-to-use-index-vs-name">When to Use Index vs Name</h2><ul><li><strong><strong>Use names</strong></strong> for stable, semantic imports (recommended)
</li><li><strong><strong>Use indexes</strong></strong> for quick prototyping or when names aren't available
</li><li>Names are more maintainable as file structure changes
</li></ul><h1 id="part-6-server-side-data-import">Part 6: Server-Side Data Import</h1><p>Import pre-computed server-side data that runs during the build process:
</p><pre class="src-block"><code class="hljs language-javascript"><span class="hljs-comment">// Import server-computed file statistics and date</span>
<span class="hljs-keyword">import</span> fileStats <span class="hljs-keyword">from</span> <span class="hljs-string">'./block-import-library.org?name=file-stats'</span>;
<span class="hljs-keyword">import</span> currentDate <span class="hljs-keyword">from</span> <span class="hljs-string">'./block-import-library.org?name=current-date'</span>;

<span class="hljs-keyword">const</span> container = <span class="hljs-variable language_">document</span>.<span class="hljs-title function_">createElement</span>(<span class="hljs-string">'div'</span>);
container.<span class="hljs-property">style</span>.<span class="hljs-property">cssText</span> = <span class="hljs-string">'padding: 1rem; background: #e0f2f1; border-radius: 8px; margin: 1rem 0;'</span>;

<span class="hljs-keyword">const</span> stats = <span class="hljs-title class_">JSON</span>.<span class="hljs-title function_">parse</span>(fileStats);

container.<span class="hljs-property">innerHTML</span> = <span class="hljs-string">`
  &#x3C;h4 style="margin-top: 0; color: #00796b;">Server-Side Data from Library&#x3C;/h4>
  &#x3C;p>&#x3C;strong>Build Date:&#x3C;/strong> <span class="hljs-subst">${currentDate}</span>&#x3C;/p>
  &#x3C;p>&#x3C;strong>Total org files:&#x3C;/strong> <span class="hljs-subst">${stats.totalFiles}</span>&#x3C;/p>
  &#x3C;details>
    &#x3C;summary style="cursor: pointer; color: #00796b; font-weight: bold;">File Details&#x3C;/summary>
    &#x3C;ul>
      <span class="hljs-subst">${stats.files.map(f => <span class="hljs-string">`&#x3C;li><span class="hljs-subst">${f.name}</span> - <span class="hljs-subst">${(f.size / <span class="hljs-number">1024</span>).toFixed(<span class="hljs-number">2</span>)}</span> KB&#x3C;/li>`</span>).join(<span class="hljs-string">''</span>)}</span>
    &#x3C;/ul>
  &#x3C;/details>
`</span>;

<span class="hljs-keyword">export</span> <span class="hljs-keyword">default</span> container;
</code></pre><div id="org-block-8-result" data-org-block="block-content-examples-block-imports-org-8" class="org-block-result"></div>
<div class="org-source-code">
        <div class="org-source-label">Source</div>
        <pre><code class="hljs language-javascript"><span class="hljs-comment">// Import server-computed file statistics and date</span>
<span class="hljs-keyword">import</span> fileStats <span class="hljs-keyword">from</span> <span class="hljs-string">'./block-import-library.org?name=file-stats'</span>;
<span class="hljs-keyword">import</span> currentDate <span class="hljs-keyword">from</span> <span class="hljs-string">'./block-import-library.org?name=current-date'</span>;

<span class="hljs-keyword">const</span> container = <span class="hljs-variable language_">document</span>.<span class="hljs-title function_">createElement</span>(<span class="hljs-string">'div'</span>);
container.<span class="hljs-property">style</span>.<span class="hljs-property">cssText</span> = <span class="hljs-string">'padding: 1rem; background: #e0f2f1; border-radius: 8px; margin: 1rem 0;'</span>;

<span class="hljs-keyword">const</span> stats = <span class="hljs-title class_">JSON</span>.<span class="hljs-title function_">parse</span>(fileStats);

container.<span class="hljs-property">innerHTML</span> = <span class="hljs-string">`
  &#x3C;h4 style="margin-top: 0; color: #00796b;">Server-Side Data from Library&#x3C;/h4>
  &#x3C;p>&#x3C;strong>Build Date:&#x3C;/strong> <span class="hljs-subst">${currentDate}</span>&#x3C;/p>
  &#x3C;p>&#x3C;strong>Total org files:&#x3C;/strong> <span class="hljs-subst">${stats.totalFiles}</span>&#x3C;/p>
  &#x3C;details>
    &#x3C;summary style="cursor: pointer; color: #00796b; font-weight: bold;">File Details&#x3C;/summary>
    &#x3C;ul>
      <span class="hljs-subst">${stats.files.map(f => <span class="hljs-string">`&#x3C;li><span class="hljs-subst">${f.name}</span> - <span class="hljs-subst">${(f.size / <span class="hljs-number">1024</span>).toFixed(<span class="hljs-number">2</span>)}</span> KB&#x3C;/li>`</span>).join(<span class="hljs-string">''</span>)}</span>
    &#x3C;/ul>
  &#x3C;/details>
`</span>;

<span class="hljs-keyword">export</span> <span class="hljs-keyword">default</span> container;
</code></pre>
      </div><h2 id="server-side-benefits">Server-Side Benefits</h2><ul><li>Execute expensive operations once at build time
</li><li>Access Node.js APIs (fs, path, etc.)
</li><li>Generate dynamic content from file system
</li><li>No client-side overhead
</li></ul><h1 id="part-7-jscad-3d-modeling">Part 7: JSCad 3D Modeling</h1><p>The most powerful demonstration: importing 3D geometry functions and composing complex scenes.
</p><style>
  .jscad-wrapper {
    position: relative;
    width: 100%;
    height: 400px;
    margin: 1rem 0;
    border-radius: 8px;
    overflow: hidden;
  }
</style>
