docs/content/examples/block-imports.org
** Composite 3D Scene

Import geometry primitives and composite shapes from the library:

#+name: composite-scene
#+begin_src javascript :use jscad
import * as jscad from '@jscad/modeling';
import { house, gear, roundedCube } from './block-import-library.org?name=jscad-base-shapes';
import { screw, bearing } from './block-import-library.org?name=jscad-composite-shapes';

const { translate, rotate } = jscad.transforms;

// Create a scene using imported geometry functions from the library
const myHouse = translate([-30, 0, 0], house(15, 12));
const myGear = translate([0, 0, 0], gear(18, 8, 12, 4));
const myRoundedCube = translate([30, -15, 0], roundedCube(12, 2));
const myScrew = translate([30, 15, 0], rotate([Math.PI / 2, 0, 0], screw(20, 4, 8)));
const myBearing = translate([-300, -20, 0], bearing(15, 8, 4));

export default [myHouse, myGear, myRoundedCube, myScrew, myBearing];
#+end_src

** 3D Import Benefits

- Build libraries of reusable 3D primitives
- Compose complex assemblies from simple parts
- Share geometry across multiple designs
- Parametric design with imported functions
- Version control your 3D primitives

* Part 8: Complex Composition

Let's combine multiple imports to create something more sophisticated.

** Define a Data Processor

First, define a local processing function:

#+name: data-processor
#+begin_src javascript
export function processData(numbers) {
  return {
    sum: numbers.reduce((a, b) => a + b, 0),
    average: numbers.reduce((a, b) => a + b, 0) / numbers.length,
    max: Math.max(...numbers),
    min: Math.min(...numbers)
  };
}
#+end_src

** Combine Local and External Imports

#+begin_src javascript :use dom | withSourceCode
// Import from THIS file (self-import)
import { processData } from './block-imports.org?name=data-processor';

// Import from EXTERNAL library file
import { fibonacci } from './block-import-library.org?name=math-utils';
import { truncate } from './block-import-library.org?name=string-utils';

// Generate fibonacci sequence using imported function
const fibSequence = Array.from({ length: 10 }, (_, i) => fibonacci(i));

// Process the data using local function
const stats = processData(fibSequence);

// Format output using imported utility
const title = truncate("Fibonacci Sequence Analysis with Mixed Imports", 40);

const container = document.createElement('div');
container.style.cssText = 'padding: 1rem; background: #f3e5f5; border-radius: 8px; margin: 1rem 0;';
container.innerHTML = `
  <h4 style="margin-top: 0; color: #7b1fa2;">${title}</h4>
  <p><strong>Sequence:</strong> [${fibSequence.join(', ')}]</p>
  <p><strong>Sum:</strong> ${stats.sum}</p>
  <p><strong>Average:</strong> ${stats.average.toFixed(2)}</p>
  <p><strong>Max:</strong> ${stats.max}</p>
  <p><strong>Min:</strong> ${stats.min}</p>
  <hr style="border: none; border-top: 1px solid #ddd; margin: 1rem 0;">
  <p><small>
    🔹 fibonacci() from <code>block-import-library.org</code><br>
    🔹 truncate() from <code>block-import-library.org</code><br>
    🔹 processData() from <code>block-imports.org</code> (this file)
  </small></p>
`;

export default container;
#+end_src

* Key Concepts Summary

** Code Reusability

Define once, use everywhere:
- Create shared libraries of utilities
- Import across multiple documents
- Maintain single source of truth
- Update once, propagate everywhere

** Modularity

Break complex logic into manageable pieces:
- Small, focused, testable blocks
- Clear dependencies and interfaces
- Easy to understand and maintain
- Promotes separation of concerns

** Composition

Combine simple blocks to create complexity:
- Layer functionality progressively
- Mix and match utilities as needed
- Build complex features from simple parts
- Enable true literate programming

** Type Safety

Use TypeScript for robust imports:
- Full type checking across files
- IDE autocomplete and hints
- Catch errors at build time
- Document interfaces naturally

** Performance Optimization

Choose the right runtime:
- **Browser runtime**: Interactive features, DOM manipulation
- **Server runtime**: Expensive computations, file system access
- **Import time**: No overhead, just code linking

** Cross-File Architecture

Organize code logically:
- Shared libraries in dedicated files
- Document-specific utilities locally
- Clear naming conventions
- Discoverable and maintainable

* Best Practices

** Naming Conventions

#+begin_export html
<pre><code>#+name: descriptive-kebab-case
#+begin_src javascript
// Use clear, descriptive names
#+end_src
</code></pre>
#+end_export

** Library Organization

Group related utilities:
- =math-utils=, =string-utils= for JavaScript
- =flex-utils=, =animation-utils= for CSS
- =jscad-base-shapes=, =jscad-composite-shapes= for 3D

** Documentation

Document your blocks:
- Add comments explaining purpose
- Show usage examples
- List exported functions
- Note any dependencies

** Version Control

Track library files separately:
- Commit libraries as stable units
- Semantic versioning for breaking changes
- Changelog for library updates

* Advanced Patterns

