examples/block-imports.html
<h2 id="composite-3d-scene">Composite 3D Scene</h2><p>Import geometry primitives and composite shapes from the library:
</p><div id="org-block-9-result" data-org-block="block-content-examples-block-imports-org-9" class="org-block-result"></div><h2 id="3d-import-benefits">3D Import Benefits</h2><ul><li>Build libraries of reusable 3D primitives
</li><li>Compose complex assemblies from simple parts
</li><li>Share geometry across multiple designs
</li><li>Parametric design with imported functions
</li><li>Version control your 3D primitives
</li></ul><h1 id="part-8-complex-composition">Part 8: Complex Composition</h1><p>Let's combine multiple imports to create something more sophisticated.
</p><h2 id="define-a-data-processor">Define a Data Processor</h2><p>First, define a local processing function:
</p><div id="org-block-10-result" data-org-block="block-content-examples-block-imports-org-10" class="org-block-result"></div><h2 id="combine-local-and-external-imports">Combine Local and External Imports</h2><pre class="src-block"><code class="hljs language-javascript"><span class="hljs-comment">// Import from THIS file (self-import)</span>
<span class="hljs-keyword">import</span> { processData } <span class="hljs-keyword">from</span> <span class="hljs-string">'./block-imports.org?name=data-processor'</span>;

<span class="hljs-comment">// Import from EXTERNAL library file</span>
<span class="hljs-keyword">import</span> { fibonacci } <span class="hljs-keyword">from</span> <span class="hljs-string">'./block-import-library.org?name=math-utils'</span>;
<span class="hljs-keyword">import</span> { truncate } <span class="hljs-keyword">from</span> <span class="hljs-string">'./block-import-library.org?name=string-utils'</span>;

<span class="hljs-comment">// Generate fibonacci sequence using imported function</span>
<span class="hljs-keyword">const</span> fibSequence = <span class="hljs-title class_">Array</span>.<span class="hljs-title function_">from</span>({ <span class="hljs-attr">length</span>: <span class="hljs-number">10</span> }, <span class="hljs-function">(<span class="hljs-params">_, i</span>) =></span> <span class="hljs-title function_">fibonacci</span>(i));

<span class="hljs-comment">// Process the data using local function</span>
<span class="hljs-keyword">const</span> stats = <span class="hljs-title function_">processData</span>(fibSequence);

<span class="hljs-comment">// Format output using imported utility</span>
<span class="hljs-keyword">const</span> title = <span class="hljs-title function_">truncate</span>(<span class="hljs-string">"Fibonacci Sequence Analysis with Mixed Imports"</span>, <span class="hljs-number">40</span>);

<span class="hljs-keyword">const</span> container = <span class="hljs-variable language_">document</span>.<span class="hljs-title function_">createElement</span>(<span class="hljs-string">'div'</span>);
container.<span class="hljs-property">style</span>.<span class="hljs-property">cssText</span> = <span class="hljs-string">'padding: 1rem; background: #f3e5f5; border-radius: 8px; margin: 1rem 0;'</span>;
container.<span class="hljs-property">innerHTML</span> = <span class="hljs-string">`
  &#x3C;h4 style="margin-top: 0; color: #7b1fa2;"><span class="hljs-subst">${title}</span>&#x3C;/h4>
  &#x3C;p>&#x3C;strong>Sequence:&#x3C;/strong> [<span class="hljs-subst">${fibSequence.join(<span class="hljs-string">', '</span>)}</span>]&#x3C;/p>
  &#x3C;p>&#x3C;strong>Sum:&#x3C;/strong> <span class="hljs-subst">${stats.sum}</span>&#x3C;/p>
  &#x3C;p>&#x3C;strong>Average:&#x3C;/strong> <span class="hljs-subst">${stats.average.toFixed(<span class="hljs-number">2</span>)}</span>&#x3C;/p>
  &#x3C;p>&#x3C;strong>Max:&#x3C;/strong> <span class="hljs-subst">${stats.max}</span>&#x3C;/p>
  &#x3C;p>&#x3C;strong>Min:&#x3C;/strong> <span class="hljs-subst">${stats.min}</span>&#x3C;/p>
  &#x3C;hr style="border: none; border-top: 1px solid #ddd; margin: 1rem 0;">
  &#x3C;p>&#x3C;small>
    🔹 fibonacci() from &#x3C;code>block-import-library.org&#x3C;/code>&#x3C;br>
    🔹 truncate() from &#x3C;code>block-import-library.org&#x3C;/code>&#x3C;br>
    🔹 processData() from &#x3C;code>block-imports.org&#x3C;/code> (this file)
  &#x3C;/small>&#x3C;/p>
`</span>;

<span class="hljs-keyword">export</span> <span class="hljs-keyword">default</span> container;
</code></pre><div id="org-block-11-result" data-org-block="block-content-examples-block-imports-org-11" class="org-block-result"></div>
<div class="org-source-code">
        <div class="org-source-label">Source</div>
        <pre><code class="hljs language-javascript"><span class="hljs-comment">// Import from THIS file (self-import)</span>
<span class="hljs-keyword">import</span> { processData } <span class="hljs-keyword">from</span> <span class="hljs-string">'./block-imports.org?name=data-processor'</span>;

<span class="hljs-comment">// Import from EXTERNAL library file</span>
<span class="hljs-keyword">import</span> { fibonacci } <span class="hljs-keyword">from</span> <span class="hljs-string">'./block-import-library.org?name=math-utils'</span>;
<span class="hljs-keyword">import</span> { truncate } <span class="hljs-keyword">from</span> <span class="hljs-string">'./block-import-library.org?name=string-utils'</span>;

<span class="hljs-comment">// Generate fibonacci sequence using imported function</span>
<span class="hljs-keyword">const</span> fibSequence = <span class="hljs-title class_">Array</span>.<span class="hljs-title function_">from</span>({ <span class="hljs-attr">length</span>: <span class="hljs-number">10</span> }, <span class="hljs-function">(<span class="hljs-params">_, i</span>) =></span> <span class="hljs-title function_">fibonacci</span>(i));

<span class="hljs-comment">// Process the data using local function</span>
<span class="hljs-keyword">const</span> stats = <span class="hljs-title function_">processData</span>(fibSequence);

<span class="hljs-comment">// Format output using imported utility</span>
<span class="hljs-keyword">const</span> title = <span class="hljs-title function_">truncate</span>(<span class="hljs-string">"Fibonacci Sequence Analysis with Mixed Imports"</span>, <span class="hljs-number">40</span>);

<span class="hljs-keyword">const</span> container = <span class="hljs-variable language_">document</span>.<span class="hljs-title function_">createElement</span>(<span class="hljs-string">'div'</span>);
container.<span class="hljs-property">style</span>.<span class="hljs-property">cssText</span> = <span class="hljs-string">'padding: 1rem; background: #f3e5f5; border-radius: 8px; margin: 1rem 0;'</span>;
container.<span class="hljs-property">innerHTML</span> = <span class="hljs-string">`
  &#x3C;h4 style="margin-top: 0; color: #7b1fa2;"><span class="hljs-subst">${title}</span>&#x3C;/h4>
  &#x3C;p>&#x3C;strong>Sequence:&#x3C;/strong> [<span class="hljs-subst">${fibSequence.join(<span class="hljs-string">', '</span>)}</span>]&#x3C;/p>
  &#x3C;p>&#x3C;strong>Sum:&#x3C;/strong> <span class="hljs-subst">${stats.sum}</span>&#x3C;/p>
  &#x3C;p>&#x3C;strong>Average:&#x3C;/strong> <span class="hljs-subst">${stats.average.toFixed(<span class="hljs-number">2</span>)}</span>&#x3C;/p>
  &#x3C;p>&#x3C;strong>Max:&#x3C;/strong> <span class="hljs-subst">${stats.max}</span>&#x3C;/p>
  &#x3C;p>&#x3C;strong>Min:&#x3C;/strong> <span class="hljs-subst">${stats.min}</span>&#x3C;/p>
  &#x3C;hr style="border: none; border-top: 1px solid #ddd; margin: 1rem 0;">
  &#x3C;p>&#x3C;small>
    🔹 fibonacci() from &#x3C;code>block-import-library.org&#x3C;/code>&#x3C;br>
    🔹 truncate() from &#x3C;code>block-import-library.org&#x3C;/code>&#x3C;br>
    🔹 processData() from &#x3C;code>block-imports.org&#x3C;/code> (this file)
  &#x3C;/small>&#x3C;/p>
`</span>;

<span class="hljs-keyword">export</span> <span class="hljs-keyword">default</span> container;
</code></pre>
      </div><h1 id="key-concepts-summary">Key Concepts Summary</h1><h2 id="code-reusability">Code Reusability</h2><p>Define once, use everywhere:
</p><ul><li>Create shared libraries of utilities
</li><li>Import across multiple documents
</li><li>Maintain single source of truth
</li><li>Update once, propagate everywhere
</li></ul><h2 id="modularity">Modularity</h2><p>Break complex logic into manageable pieces:
</p><ul><li>Small, focused, testable blocks
</li><li>Clear dependencies and interfaces
</li><li>Easy to understand and maintain
</li><li>Promotes separation of concerns
</li></ul><h2 id="composition">Composition</h2><p>Combine simple blocks to create complexity:
</p><ul><li>Layer functionality progressively
</li><li>Mix and match utilities as needed
</li><li>Build complex features from simple parts
</li><li>Enable true literate programming
</li></ul><h2 id="type-safety">Type Safety</h2><p>Use TypeScript for robust imports:
</p><ul><li>Full type checking across files
</li><li>IDE autocomplete and hints
</li><li>Catch errors at build time
</li><li>Document interfaces naturally
</li></ul><h2 id="performance-optimization">Performance Optimization</h2><p>Choose the right runtime:
</p><ul><li><strong><strong>Browser runtime</strong></strong>: Interactive features, DOM manipulation
</li><li><strong><strong>Server runtime</strong></strong>: Expensive computations, file system access
</li><li><strong><strong>Import time</strong></strong>: No overhead, just code linking
</li></ul><h2 id="cross-file-architecture">Cross-File Architecture</h2><p>Organize code logically:
</p><ul><li>Shared libraries in dedicated files
</li><li>Document-specific utilities locally
</li><li>Clear naming conventions
</li><li>Discoverable and maintainable
</li></ul><h1 id="best-practices">Best Practices</h1><h2 id="naming-conventions">Naming Conventions</h2><pre><code>#+name: descriptive-kebab-case
#+begin_src javascript
// Use clear, descriptive names
#+end_src
</code></pre>
<h2 id="library-organization">Library Organization</h2><p>Group related utilities:
</p><ul><li><code class="inline-verbatim">math-utils</code>, <code class="inline-verbatim">string-utils</code> for JavaScript
</li><li><code class="inline-verbatim">flex-utils</code>, <code class="inline-verbatim">animation-utils</code> for CSS
</li><li><code class="inline-verbatim">jscad-base-shapes</code>, <code class="inline-verbatim">jscad-composite-shapes</code> for 3D
</li></ul><h2 id="documentation">Documentation</h2><p>Document your blocks:
</p><ul><li>Add comments explaining purpose
</li><li>Show usage examples
</li><li>List exported functions
</li><li>Note any dependencies
</li></ul><h2 id="version-control">Version Control</h2><p>Track library files separately:
</p><ul><li>Commit libraries as stable units
</li><li>Semantic versioning for breaking changes
</li><li>Changelog for library updates
